//
// Space Invaders 1978 in C
// Jason McSweeney

#define _XOPEN_SOURCE

#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <ucontext.h>
#include <stdint.h>
#include <assert.h>
#include <SDL.h>
#include <assert.h>
#include <string.h>

#define OP_BLEND 0
#define OP_ERASE 1
#define OP_COLLIDE 2
#define OP_BLIT 3

#define SHOT_ACTIVE 0x80
#define SHOT_BLOWUP 0x1

#define BEAM_VBLANK 0x80
#define BEAM_MIDDLE 0x00
#define XR_MID 0x80

#define DIP3_SHIPS1 0x1
#define DIP5_SHIPS2 0x2
#define DIP6_BONUS 0x8
#define DIP7_COININFO 0x80

#define TILT_BIT 0x4
#define COIN_BIT 0x1

#define INIT 1
#define PROMPT 2
#define SHIELDS 4

#define ROL_SHOT_PICEND 0xf9
#define PLU_SHOT_PICEND 0xed
#define SQU_SHOT_PICEND 0xdb

#define PLAYER_ADDR 0x2010
#define PLAYER_SIZE 16
#define PLAYER_SHOT_ADDR 0x2020
#define PLAYER_SHOT_DATA_ADDR 0x2025
#define PLAYER_SHOT_DATA_SIZE 7
#define ROLLING_SHOT_ADDR 0x2030
#define ROLLING_SHOT_SIZE 16
#define PLUNGER_SHOT_ADDR 0x2040
#define PLUNGER_SHOT_SIZE 16
#define SQUIGGLY_SHOT_ADDR 0x2050
#define SQUIGGLY_SHOT_SIZE 16
#define SAUCER_ADDR 0x2083
#define SAUCER_SIZE 10
// 玩家 1 RAM 区域起始地址
#define P1_ADDR 0x2100 
// 玩家 2 RAM 区域起始地址
#define P2_ADDR 0x2200
// splash 描述符起始地址
#define SPLASH_DESC_ADDR 0x20c5

#if __BYTE_ORDER__ != __ORDER_LITTLE_ENDIAN__
#error "This code is Little Endian only."
#endif

// 模拟 8080 处理器的 word
struct Word
{
    // 三种模式，都是 16 bits
    union
    {

        uint16_t u16;
        struct
        {
            uint8_t l;
            uint8_t h;
        };

        struct
        {
            uint8_t y;
            uint8_t x;
        };
    };
} __attribute__((packed)); // 4

// 模拟 8080 处理器的 word
typedef struct Word Word;

// 精灵对象描述结构体，保存图片文件位置、显示坐标、突破大小
struct SprDesc
{
    // 图片位置指针
    Word spr;

    union
    {
        // 像素位置
        Word pos; // pixel position
        // sc 地址
        Word sc;  // screen address
    };

    // 图片大小
    uint8_t n;

} __attribute__((packed)); // 5

// 精灵对象描述结构体，保存图片文件位置、显示坐标、突破大小
typedef struct SprDesc SprDesc;

/**
 * 游戏结构对象控制块
 * 在内存中的顺序就是
 * TimerMSB
 * TimerLSB
 * TimerExtra
 * objHandler
 */
struct GameObjHeader
{
    uint8_t TimerMSB;   
    uint8_t TimerLSB;
    uint8_t TimerExtra;
    Word Handler;

} __attribute__((packed)); // 5

/**
 * 游戏结构对象控制块
 * 在内存中的顺序就是
 * TimerMSB
 * TimerLSB
 * TimerExtra
 * objHandler
 */
typedef struct GameObjHeader GameObjHeader;

// 射击控制块
struct AShot
{
    uint8_t Status;     // 射击状态标志位 bit 0 置位表示正在爆炸，bit 7 置位表示激活
    uint8_t StepCnt;    // step计数，用于 reload rate 计算
    uint8_t Track;      // 0 表示追踪玩家 1 表示使用 fire table
    Word CFir;          // fire table 指针
    uint8_t BlowCnt;    // 外星人子弹爆炸计数器，3 表示爆炸已绘制，0 表示完成
    SprDesc Desc;       // 图像控制块

} __attribute__((packed)); // 11

// 射击动画控制块
typedef struct AShot AShot;

// 模拟街机的 RAM 与 ROM ，后面的 __attribute  ((packed)) 表示取消优化对齐，防止读取时出现错位
struct Mem
{
    /**
     * ROM 中数据区域，包含原版代码和图像数据
     * 内存区域分配：
     * 0000-1FFF 8K ROM
     * 2000-23FF 1K RAM
     * 2400-3FFF 7K Video RAM
     * 4000- RAM mirror
     * 
     * 所存储的具体内容对应请看 https://computerarcheology.com/Arcade/SpaceInvaders/Code.html
     */
    uint8_t pad_01[3063];                         //  0x0000
    uint8_t MSG_TAITO_COP[9];                     //  0x0bf7
    uint8_t pad_02[3601];                         //  0x0c00
    uint8_t soundDelayKey[16];                    //  0x1a11
    uint8_t soundDelayValue[16];                  //  0x1a21
    uint8_t pad_03[112];                          //  0x1a31
    uint8_t ShotReloadRate[5];                    //  0x1aa1
    uint8_t MSG_GAME_OVER__PLAYER___[20];         //  0x1aa6
    uint8_t MSG_1_OR_2PLAYERS_BUTTON[20];         //  0x1aba
    uint8_t pad_04;                               //  0x1ace
    uint8_t MSG_ONLY_1PLAYER__BUTTON[20];         //  0x1acf
    uint8_t pad_05;                               //  0x1ae3
    uint8_t MSG__SCORE_1__HI_SCORE_SCORE_2__[28]; //  0x1ae4
    uint8_t pad_06[112];                          //  0x1b00
    uint8_t MSG_PLAY_PLAYER_1_[14];               //  0x1b70
    uint8_t pad_07[66];                           //  0x1b7e
    uint8_t SPLASH_SHOT_OBJDATA[16];              //  0x1bc0
    uint8_t pad_08[144];                          //  0x1bd0
    uint8_t PLAYER_SPRITES[48];                   //  0x1c60
    uint8_t pad_09[9];                            //  0x1c90
    uint8_t MSG__10_POINTS[10];                   //  0x1c99
    uint8_t MSG__SCORE_ADVANCE_TABLE_[21];        //  0x1ca3
    uint8_t AReloadScoreTab[4];                   //  0x1cb8
    uint8_t MSG_TILT[4];                          //  0x1cbc
    uint8_t pad_10[28];                           //  0x1cc0
    uint8_t AlienShotExplodingSprite[6];          //  0x1cdc
    uint8_t pad_11[24];                           //  0x1ce2
    uint8_t MSG_PLAY2[5];                         //  0x1cfa
    uint8_t pad_12[33];                           //  0x1cff
    uint8_t SHIELD_SPRITE[44];                    //  0x1d20
    uint8_t SauScrValueTab[4];                    //  0x1d4c 飞碟得分表
    uint8_t SauScrStrTab[4];                      //  0x1d50 飞碟得分表对应字符
    uint8_t pad_13[40];                           //  0x1d54
    uint8_t SpriteSaucerExp[24];                  //  0x1d7c
    uint8_t MSG__50[3];                           //  0x1d94
    uint8_t MSG_100[3];                           //  0x1d97
    uint8_t MSG_150[3];                           //  0x1d9a
    uint8_t MSG_300[3];                           //  0x1d9d
    uint8_t AlienScores[3];                       //  0x1da0
    uint8_t AlienStartTable[8];                   //  0x1da3
    uint8_t MSG_PLAY[4];                          //  0x1dab
    uint8_t MSG_SPACE__INVADERS[15];              //  0x1daf
    uint8_t SCORE_ADV_SPRITE_LIST[17];            //  0x1dbe
    uint8_t SCORE_ADV_MSG_LIST[17];               //  0x1dcf
    uint8_t MSG____MYSTERY[10];                   //  0x1de0
    uint8_t MSG__30_POINTS[10];                   //  0x1dea
    uint8_t MSG__20_POINTS[10];                   //  0x1df4
    uint8_t pad_14[338];                          //  0x1dfe
    uint8_t MSG__1_OR_2_PLAYERS___[18];           //  0x1f50
    uint8_t pad_15[46];                           //  0x1f62
    uint8_t MSG_INSERT__COIN[12];                 //  0x1f90
    uint8_t CREDIT_TABLE[4];                      //  0x1f9c
    uint8_t CREDIT_TABLE_COINS[9];                //  0x1fa0
    uint8_t MSG_CREDIT_[7];                       //  0x1fa9
    uint8_t pad_16[67];                           //  0x1fb0
    uint8_t MSG_PUSH[4];                          //  0x1ff3
    uint8_t pad_17[9];                            //  0x1ff7

    // start of ram mirror
    // 每个字段内容详细解释见 https://computerarcheology.com/Arcade/SpaceInvaders/RAMUse.html

    uint8_t waitOnDraw;           //  0x2000 由 alien-draw 清除，并设置 next-alien. 这个标志位确保在绘制时不落下任何一个外星人
    uint8_t pad_18;               //  0x2001
    uint8_t alienIsExploding;     //  0x2002 非 0 有外星飞船正在爆炸，0 没有外星飞船正在爆炸
    uint8_t expAlienTimer;        //  0x2003 飞船爆炸剩余时间（ISR tick）
    uint8_t alienRow;             //  0x2004 当前外星人所在的行
    uint8_t alienFrame;           //  0x2005 当前外星人动画帧编号（0 或 1）
    uint8_t alienCurIndex;        //  0x2006 当前外星人下标（0 到 55）
    Word refAlienDelta;           //  0x2007 外星飞船参考移动距离
    Word refAlienPos;             //  0x2009 外星飞船参考坐标
    Word alienPos;                //  0x200b 外星人坐标
    uint8_t rackDirection;        //  0x200d 外星飞船移动方向
    uint8_t rackDownDelta;        //  0x200e
    uint8_t pad_19;               //  0x200f
    GameObjHeader playerHeader;   //  0x2010
    uint8_t playerAlive;          //  0x2015 0xff=存活，爆炸时候 0 1 之间翻转
    uint8_t expAnimateTimer;      //  0x2016
    uint8_t expAnimateCnt;        //  0x2017
    SprDesc playerDesc;           //  0x2018
    uint8_t nextDemoCmd;          //  0x201d 演示模式下下一个移动指令
    uint8_t hidMessSeq;           //  0x201e
    uint8_t pad_20;               //  0x201f
    GameObjHeader plyrShotHeader; //  0x2020
    uint8_t plyrShotStatus;       //  0x2025 0 存活，1 刚初始化，2 正常移动，3 击中非外星人，5 正在处理外星人爆炸，4 外星人已爆炸（从活动状态移除）
    uint8_t blowUpTimer;          //  0x2026
    SprDesc playerShotDesc;       //  0x2027
    uint8_t shotDeltaYr;          //  0x202c
    uint8_t fireBounce;           //  0x202d
    uint8_t pad_21[2];            //  0x202e
    GameObjHeader rolShotHeader;  //  0x2030
    AShot rolShotData;            //  0x2035
    GameObjHeader pluShotHeader;  //  0x2040
    AShot pluShotData;            //  0x2045
    GameObjHeader squShotHeader;  //  0x2050
    AShot squShotData;            //  0x2055
    uint8_t pad_22;               //  0x2060
    uint8_t collision;            //  0x2061
    SprDesc expAlien;             //  0x2062 爆炸飞船图片 1CC0
    uint8_t playerDataMSB;        //  0x2067 当前玩家数据区域 MSB （21xx 或 22xx)
    uint8_t playerOK;             //  0x2068 1 代表 ok，0 代表爆炸
    uint8_t enableAlienFire;      //  0x2069 1 代表外星人可以开火，0 表示不能
    uint8_t alienFireDelay;       //  0x206a
    uint8_t pad_23;               //  0x206b
    uint8_t temp206C;             //  0x206c 存储数字 10，但是在启动时是 18
    uint8_t invaded;              //  0x206d
    uint8_t skipPlunger;          //  0x206e 只剩一个外星人的时候置 1 来关闭 plunger shot
    uint8_t pad_24;               //  0x206f
    uint8_t otherShot1;           //  0x2070
    uint8_t otherShot2;           //  0x2071
    uint8_t vblankStatus;         //  0x2072
    AShot aShot;                  //  0x2073
    uint8_t alienShotDelta;       //  0x207e
    uint8_t shotPicEnd;           //  0x207f 当前外星人射击动画的最后一个图片地址
    uint8_t shotSync;             //  0x2080 所有 3 种射击类型都与 GO-2 时间同步，在 game loop 中从 timer 中更新
    uint8_t tmp2081;              //  0x2081
    uint8_t numAliens;            //  0x2082 屏幕上外星人数目
    uint8_t saucerStart;          //  0x2083 出现飞碟标志（当 0x2091-0x2092 归零的时候置 1）
    uint8_t saucerActive;         //  0x2084 1 表示飞碟在屏幕上
    uint8_t saucerHit;            //  0x2085 飞碟被打了（1 表示绘制但是不要移动）
    uint8_t saucerHitTime;        //  0x2086 打击时序（用于控制当前应该播放什么动画） 
    SprDesc saucerDesc;           //  0x2087 飞碟打印描述符
    uint8_t saucerDXr;            //  0x208c
    Word sauScore;                //  0x208d
    Word shotCount;               //  0x208f
    Word saucerTimer;             //  0x2091 每次游戏循环减少， 到 0 时飞碟出现重置到 600
    uint8_t waitStartLoop;        //  0x2093 1=循环等待开始，0=在初始屏幕
    uint8_t soundPort3;           //  0x2094
    uint8_t changeFleetSnd;       //  0x2095
    uint8_t fleetSndCnt;          //  0x2096 延时直到下一次移动音乐到来
    uint8_t fleetSndReload;       //  0x2097
    uint8_t soundPort5;           //  0x2098
    uint8_t extraHold;            //  0x2099
    uint8_t tilt;                 //  0x209a 正在处理 tilt 时为 1
    uint8_t fleetSndHold;         //  0x209b
    uint8_t pad_25[36];           //  0x209c

    // end of partial ram restore at 0x20c0

    uint8_t isrDelay;         //  0x20c0 延迟计数器，在 ISR 中递减
    uint8_t isrSplashTask;    //  0x20c1 1=demo 模式, 2=小外星人拿Y, 4=射击多余的'C'
    uint8_t splashAnForm;     //  0x20c2
    Word splashDelta;         //  0x20c3
    Word splashPos;           //  0x20c5
    Word splashPic;           //  0x20c7
    uint8_t splashPicSize;    //  0x20c9
    uint8_t splashTargetX;    //  0x20ca
    uint8_t splashReached;    //  0x20cb
    Word splashImRest;        //  0x20cc
    uint8_t twoPlayers;       //  0x20ce 1=两个玩家，0=一个玩家
    uint8_t aShotReloadRate;  //  0x20cf 外星人装弹速度
    uint8_t pad_26[21];       //  0x20d0
    Word playerExtras;        //  0x20e5 被授予额外的船=0
    Word playerStates;        //  0x20e7 1=玩家存活，0=玩家死亡
    uint8_t gameTasksRunning; //  0x20e9 1=游戏对象正在移动，0=游戏对象暂停
    uint8_t coinSwitch;       //  0x20ea
    uint8_t numCoins;         //  0x20eb 硬币数（BCD 码格式，最多 99）
    uint8_t splashAnimate;    //  0x20ec 0=初始界面动画，1=不是
    Word demoCmdPtr;          //  0x20ed 指向演示模式命令的指针
    uint8_t gameMode;         //  0x20ef 1=游戏中 0=欢迎界面
    uint8_t pad_27;           //  0x20f0
    uint8_t adjustScore;      //  0x20f1 如果需要调整设为 1
    Word scoreDelta;          //  0x20f2 分数调整
    Word HiScor;              //  0x20f4 最高分描述符
    uint8_t pad_28[2];        //  0x20f6
    Word P1Scor;              //  0x20f8
    uint8_t pad_29[2];        //  0x20fa
    Word P2Scor;              //  0x20fc
    uint8_t pad_30[68];       //  0x20fe

    // end of ram mirror at 0x2100

    uint8_t p1ShieldBuffer[176]; //  0x2142
    uint8_t pad_31[9];           //  0x21f2
    uint8_t p1RefAlienDX;        //  0x21fb
    Word p1RefAlienPos;          //  0x21fc 参考外星人坐标
    uint8_t p1RackCnt;           //  0x21fe 飞船数(初始是 0 但是会增加  1-8)
    uint8_t p1ShipsRem;          //  0x21ff 当前死后剩余船数量
    uint8_t pad_32[66];          //  0x2200
    uint8_t p2ShieldBuffer[176]; //  0x2242
    uint8_t pad_33[9];           //  0x22f2
    uint8_t p2RefAlienDX;        //  0x22fb
    Word p2RefAlienPos;          //  0x22fc 参考外星人坐标
    uint8_t p2RackCnt;           //  0x22fe 飞船数(初始是 0 但是会增加  1-8)
    uint8_t p2ShipsRem;          //  0x22ff 当前死后剩余船数量
    uint8_t pad_34[256];         //  0x2300
    uint8_t vram[7168];          //  0x2400 游戏显存

    // Technically the region below is supposed to be a mirror, but AFAICT,
    // that property is not used by the SI code.
    //
    // The 'PLAy' animation does do some oob writes during DrawSprite,
    // which effectively do nothing because they end up trying to write to ROM
    //
    // So, as a catchall, we just reserve this area up to the end of the address space.

    uint8_t oob[49152]; //  0x4000

} __attribute((packed));

typedef struct Mem Mem;

typedef struct PriCursor
{
    uint8_t *src;
    Word sc;
    uint8_t *obj;
} PriCursor;

typedef struct ShieldBufferCursor
{
    Word sc;
    uint8_t *iter;
} ShieldBufferCursor;

typedef enum YieldReason
{
    YIELD_INIT = 0,
    YIELD_TIMESLICE,
    YIELD_INTFIN,
    YIELD_WAIT_FOR_START,
    YIELD_PLAYER_DEATH,
    YIELD_INVADED,
    YIELD_TILT,
    YIELD_UNKNOWN,
} YieldReason;

enum Keys
{
    // 12 种按键每个 bit 记录一种按键（将数字转为 2 进制就可以看到了）
    KEYS_LEFT = 1,
    KEYS_RIGHT = 2,
    KEYS_START = 4,
    KEYS_START2 = 8,
    KEYS_FIRE = 16,
    KEYS_COIN = 32,
    KEYS_TILT = 64,
    KEYS_DIP6 = 128,
    KEYS_DIP7 = 256,
    KEYS_SPECIAL1 = 512,
    KEYS_SPECIAL2 = 1024,
    KEYS_QUIT = 2048
};

// KEY_MAP 在后面有定义
#define KEY_LIST                 \
    KEY_MAP('a', KEYS_LEFT);     \
    KEY_MAP('d', KEYS_RIGHT);    \
    KEY_MAP('1', KEYS_START);    \
    KEY_MAP('2', KEYS_START2);   \
